app/controllers/api/comments_controller.rb

INSERT INTO "comments" ("event_id", "user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["event_id", 4], ["user_id", 3], ["body", "some comment body"], ["created_at", 2017-02-06 14:01:12 UTC], ["updated_at", 2017-02-06 14:01:12 UTC]]
---
  def create
    @comment=@event.comments.build(comment_params)
    @comment.user_id=current_user.id
    respond_to do |format|
      if @comment.save