app/controllers/api/documents_controller.rb

  def set_event
    @event=Event.find(params[:event_id])
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]