app/controllers/api/events_controller.rb

  def index


    if params[:due]
      time=params[:due]
      events=current_user.events.search_everywhere(time)
      attached=current_user.attached_events.search_everywhere(time)
      respond_to do |format|
        format.json { render json: events+attached }
      end

    elsif params[:interval]
      interval=params[:interval].scan(/\d/).join('').to_i
      events=current_user.events.where(time: Time.now..(Time.now+interval.day))
---
SELECT "events".* FROM "events" INNER JOIN "attached_events_users" ON "events"."id" = "attached_events_users"."event_id" INNER JOIN (SELECT "events"."id" AS pg_search_id, (ts_rank((to_tsvector('simple', coalesce("events"."time"::text, ''))), (to_tsquery('simple', ''' ' || '2017-08-08' || ' ''')), 0)) AS rank FROM "events" WHERE (((to_tsvector('simple', coalesce("events"."time"::text, ''))) @@ (to_tsquery('simple', ''' ' || '2017-08-08' || ' '''))))) AS pg_search_862417b9e7c3720bcb3263 ON "events"."id" = pg_search_862417b9e7c3720bcb3263.pg_search_id WHERE "attached_events_users"."user_id" = $1 ORDER BY pg_search_862417b9e7c3720bcb3263.rank DESC, "events"."id" ASC  [["user_id", 23]]

  def create
    @event = current_user.events.create(event_params)
---
INSERT INTO "events" ("place", "time", "end_time", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"