app/controllers/api/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at", "email", "password_digest") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", 2017-02-06 14:33:22 UTC], ["updated_at", 2017-02-06 14:33:22 UTC], ["email", "dimka@gmail.com"], ["password_digest", "$2a$10$tUutPAGpViCSla/yyH2fjeIHZmAHBiAPbDR3dptvpAM63Aa5Dou.2"]]
---
  def create
    @user =User.create(user_params)