app/views/comments/_comments.html.erb

<% if event.comments.any? %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."event_id" = $1  [["event_id", 2]]

      <% event.comments.each do |comment| %>
          <% if comment.user.present? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]