app/controllers/comments_controller.rb

  def create
    @event=Event.find(params[:event_id])
    @comment=@event.comments.build(comment_params)
    @comment.user_id=current_user.id
    respond_to do |format|
      if @comment.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "comments" ("event_id", "user_id", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["event_id", 3], ["user_id", 1], ["body", "sffdsdfg"], ["created_at", 2017-02-03 12:53:34 UTC], ["updated_at", 2017-02-03 12:53:34 UTC]]