app/controllers/documents_controller.rb

  def create
    @event = Event.find(params[:event_id])
    @document=@event.documents.build(document_params)
    @document.user_id=current_user.id
    respond_to do |format|
      if @document.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "documents" ("event_id", "user_id", "name", "attachment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["event_id", 3], ["user_id", 1], ["name", "New Name"], ["attachment", "tickets.pdf"], ["created_at", 2017-02-03 13:43:08 UTC], ["updated_at", 2017-02-03 13:43:08 UTC]]