app/controllers/events_controller.rb

  def create
    @events
    @event = current_user.events.create(event_params)
---
INSERT INTO "events" ("place", "time", "end_time", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"