app/controllers/invites_controller.rb

  def create
    @event=Event.find(params[:event_id])
    @invite = @event.invites.build(invite_params)
    @invite.sender_id = current_user.id

    respond_to do |format|
      if @invite.save
---
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "invites" ("token", "email", "event_id", "sender_id", "recipient_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"