app/controllers/notifications_controller.rb

  def show
    notification = Notification.find(params[:id])
    event=Event.find(notification.event_id)
    AttachedEventsUser.create(user_id: current_user.id, event_id: event.id)
    redirect_url = params[:redirect_url]
    if notification.delete && redirect_url.present?
---
SELECT  "notifications".* FROM "notifications" WHERE "notifications"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
INSERT INTO "attached_events_users" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 8], ["event_id", 3], ["created_at", 2017-02-07 13:35:23 UTC], ["updated_at", 2017-02-07 13:35:23 UTC]]
DELETE FROM "notifications" WHERE "notifications"."id" = $1  [["id", 2]]