app/controllers/users_controller.rb

SELECT  "invites".* FROM "invites" WHERE "invites"."token" = $1 LIMIT $2  [["token", "e54bff787e9959d11ea728f586d5c23a69a9df02"], ["LIMIT", 1]]
INSERT INTO "attached_events_users" ("user_id", "event_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 23], ["event_id", 17], ["created_at", 2017-02-08 10:35:23 UTC], ["updated_at", 2017-02-08 10:35:23 UTC]]
INSERT INTO "users" ("created_at", "updated_at", "password_digest", "email", "encrypted_password", "remember_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
UPDATE "invites" SET "recipient_id" = $1, "updated_at" = $2 WHERE "invites"."id" = $3  [["recipient_id", 23], ["updated_at", 2017-02-08 10:35:23 UTC], ["id", 19]]
---
  def create
    super
    if @token != nil
      invite = Invite.find_by_token(@token)
      if invite !=nil
        invite.recipient_id=current_user.id
        AttachedEventsUser.create(user_id: current_user.id, event_id: invite.event.id)
        invite.save